app/Controllers/AuthController.php

SELECT *
FROM `usuario`
WHERE `email` = 'brunoperez700@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $validations = $this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'El email es obligatorio',
                    'valid_email' => 'Debe ingresar un email válido',
                ]
            ],
            'contraseña' => [
                'rules' => 'required|min_length[8]',
                'errors' => [
                    'required' => 'La contraseña es obligatoria',
                    'min_length' => 'La contraseña debe tener al menos 8 caracteres'
                ]
            ],
        ]);

        if (!$validations) {
            return $this->cargarVista('login', [
                'titulo' => 'Login',
                'validaciones' => $this->validator
            ]);
        }

        $session = session();
        $contraseña = $this->request->getPost('contraseña');
        $email = $this->request->getPost('email');
        $usuario = $this->usuarioModel->where('email', $email)->first();