app/Controllers/BaseController.php

    public function cargarVista($vista, $data = [])
    {
        $categoriaModel = new CategoriaModel();
        $categorias = $categoriaModel->findAll();
---
SELECT *
FROM `categoria`