app/Controllers/CategoriaController.php

	public function index()
	{
		$categoriasModel = new CategoriaModel();
		$data['categorias']= $categoriasModel->findAll();
---
SELECT *
FROM `categoria`