app/Controllers/CompraController.php

SELECT *
FROM `pedido`
---
    public function listar()
    {
        $pedidoModel = new PedidoModel();
        $pedidos = $pedidoModel->findAll();