app/Controllers/ConsultasController.php

SELECT *
FROM `consulta`
---
    public function listar()
    {
        $consultaModel = new ConsultaModel();
        $data['consultas'] = $consultaModel->findAll();