app/Controllers/Home.php

SELECT *
FROM `pedido`
WHERE `usuario_id` = '3'
---
    public function listaDeCompras()
    {
        $pedidoModel = new PedidoModel();
        $usuarioId = session()->get('user_id');
        $pedidos = $pedidoModel->where('usuario_id', $usuarioId)->FindAll();