app/Controllers/MarcaController.php

SELECT *
FROM `marca`
---
	public function index()
	{
		$marcaModel = new MarcaModel();
		$data['marcas'] = $marcaModel->findAll();