app/Controllers/ProductosController.php

  public function listar()
  {
    $productoTalleModel = new ProductoTalleModel();
    $talles = $productoTalleModel->findAll();
    $productos = $this->productoModel->where('activo', 1)->findAll();
---
SELECT *
FROM `producto_talle`
SELECT *
FROM `producto`
WHERE `activo` = 1