app/Models/PedidoModel.php

    public function getPedidosConDetalles($pedido_id)
    {
        return $this->select('
                pedido.id as pedido_id,
                pedido.usuario_id,
                pedido.total as pedido_total,
                pedido.metodo_pago,
                pedido.created_at,
                dp.id as detalle_id,
                pr.precio,
                dp.cantidad,
                dp.subtototal,
                pr.nombre as producto_nombre,
                pr.imagen,
                pt.talle
            ')
            ->join('detalle_pedido dp', 'dp.pedido_id = pedido.id')
            ->join('producto_talle pt', 'pt.id = dp.producto_talle_id')
            ->join('producto pr', 'pr.id = pt.producto_id')
            ->where('pedido.id', $pedido_id)
            ->orderBy('pedido.created_at', 'DESC')
            ->orderBy('dp.id', 'ASC')->get();
---
SELECT `pedido`.`id` as `pedido_id`, `pedido`.`usuario_id`, `pedido`.`total` as `pedido_total`, `pedido`.`metodo_pago`, `pedido`.`created_at`, `dp`.`id` as `detalle_id`, `pr`.`precio`, `dp`.`cantidad`, `dp`.`subtototal`, `pr`.`nombre` as `producto_nombre`, `pr`.`imagen`, `pt`.`talle`
FROM `pedido`
JOIN `detalle_pedido` `dp` ON `dp`.`pedido_id` = `pedido`.`id`
JOIN `producto_talle` `pt` ON `pt`.`id` = `dp`.`producto_talle_id`
JOIN `producto` `pr` ON `pr`.`id` = `pt`.`producto_id`
WHERE `pedido`.`id` = '15'
ORDER BY `pedido`.`created_at` DESC, `dp`.`id` ASC

    public function findAllWithUser()
    {
        return $this->select('pedido.*, usuario.nombre as nombre_usuario')
            ->join('usuario', 'usuario.id = pedido.usuario_id', 'left')
            ->findAll();
---
SELECT `pedido`.*, `usuario`.`nombre` as `nombre_usuario`
FROM `pedido`
LEFT JOIN `usuario` ON `usuario`.`id` = `pedido`.`usuario_id`